[
  {
    "ID": 78410,
    "Work Item Type": "Test Case",
    "Title": "VM - Ballot Add/Maintain Ballot",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Login application and navigate to Voter Management and click on Voter Ballot",
        "Step Expected": "Search Absentee Ballot page is dispalyed "
      },
      {
        "Step": 2,
        "Step Action": "Search for Voter by Voter ID or Last name ",
        "Step Expected": "Voter Search results are displayed"
      },
      {
        "Step": 3,
        "Step Action": "Select Voter and click on Actions and click the View Ballots ",
        "Step Expected": "Absentee Ballot Voter Information page is displayed"
      },
      {
        "Step": 4,
        "Step Action": "Click on the Add button",
        "Step Expected": "Expanded view of Voter Ballot page is displayed along with the Voter Information"
      },
      {
        "Step": 5,
        "Step Action": "In the Ballot Request Information verify the required fields and compare with V9 data for the dropdown values\\nElection Date and Name, Ballot Type, Request Date and Application Received By",
        "Step Expected": "Election Date and Name are required fields\\nBallot Type are required field\\nRequest Date and Application Received By are required fields"
      },
      {
        "Step": 6,
        "Step Action": "When select Multiple Ballot Requested checkbox verify the Multiple Request Reason dropdown values and when select OTHER from the dropdown the Other Text field column is highlighted",
        "Step Expected": "All the Multiple Ballot Requested reasons are displayed and the Other text field is highlighted when OTHER is selected"
      },
      {
        "Step": 7,
        "Step Action": "When select Application Denied checkbox verify the Multiple Request Reason dropdown values and when select OTHER from the dropdown the Other Text field column is highlighted\\n",
        "Step Expected": "All the Application Denied reasons are displayed and the Other text field is highlighted when OTHER is selected\\n"
      },
      {
        "Step": 8,
        "Step Action": "Verify the required fields for Regular Absentee Voter Reason dropdown values matches the reasons displayed in V9\\nApplication type =FPCA and Notes ",
        "Step Expected": "Regular Absentee Reason dropdown values match v9\\nApplication type = FPCA \\ncheckbox for Lives Within City Limits\\nNotes text field displayed"
      },
      {
        "Step": 9,
        "Step Action": "In the Ballot Issued Information section verify the \\nIssue Date format\\nBallot Delivered By\\nNotes\\nCheckbox for Emergency Ballot\\nAbility to default to Domestic Address and has international address information",
        "Step Expected": "All the below fields are available and the works as expected"
      },
      {
        "Step": 10,
        "Step Action": "Verify the following actions are successfully performed for UOCOVA voters \\nUOCAVA: If UOCAVA forwarding address is available in the voter registration and the start and end date is between the election date-see expected resultMailing: If UOCAVA forwarding address is not present or is out of the start or end date in the voter registration information-see expected result.Residential: If UOCAVA and Mailing address are not present in the voter registration information then-see expected result",
        "Step Expected": "UOCAVA: If UOCAVA forwarding address is available and the current date is between the start and end date of UOCAVA, then the UOCAVA forwarding address will auto populate. Mailing: If UOCAVA forwarding address is not present or is out of the start or end date then the Voter Mailing address will be used.Residential: If UOCAVA and Mailing address are not present then the Voter Residential address will be used. "
      },
      {
        "Step": 11,
        "Step Action": "In the Ballot Returned Information verify the following\\n1. Date Ballot Received\\n2. Ballot Received By\\n3. Person Delivering Ballot\\n4.Ballot Return Status dropdown is available\\n5. Ballot Return Status Reason is enabled when a Ballot Return status is selected\\n6. Checkbox for Ballot Provisional or Challenged is available and when check that box      the Ballot Provisional or Challenged Reason is enabled and required\\n7. Note section is available\\n8. Voter Assisted checkbox is available and when selected the Person Assisting with Ballot first and last Name with Phone number gets enabled",
        "Step Expected": "All the fields work as expected with reasons taken from v9 are available for Ballot Return Status and Ballot Return Status Reason "
      }
    ],
    "Area Path": "SG\\\\Elections\\Java\\EMS\\VM",
    "Assigned To": "Rina Pilli <rpilli@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 81248,
    "Work Item Type": "Test Case",
    "Title": "Verify Absentee ballot details appear in the new tab",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Home > Search for voter > Actions > View Voter Information page> Absentee Ballot History tab.",
        "Step Expected": "Absentee ballot details are displayed in the Voter Details tab.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 82097,
    "Work Item Type": "Test Case",
    "Title": "VM - Ballot - Add/Maintain (Absentee) Ballot display signature",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Navigate to the 'Add Ballot' screen for a voter (that has no uploaded signature)\\nVM > Voter > Search for Active Voter (Without Signature)> Click actions and select 'Add Absentee Ballot'",
        "Step Expected": "'NO SIGNATURE ON FILE' button is displayed grayed out."
      },
      {
        "Step": 2,
        "Step Action": "Navigate to the 'Add Ballot' screen for a voter (that has uploaded a signature)\\nVM > Voter > Search for Active Voter (With Signature)> Click actions and select 'Add Absentee Ballot'\\n",
        "Step Expected": "'VIEW SIGNATURE' button appears "
      },
      {
        "Step": 3,
        "Step Action": "Click the 'VIEW SIGNATURE'",
        "Step Expected": "Popup/Modal appears and displays the voters signature"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java\\EMS\\VM\\Ballot",
    "Assigned To": "Michael Gallo <mgallo@gocivix.com>",
    "State": "Ready"
  },
  {
    "ID": 85119,
    "Work Item Type": "Test Case",
    "Title": "66825-Verify Add/Maintain Absentee Ballot Request Information Page Updates",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Navigate to VoterMgmt>Voter>Search>Activevoter>Select voter>add absentee ballot>ballot request information \\n\\n",
        "Step Expected": "Create Ballot Page must be displayed\\n"
      },
      {
        "Step": 2,
        "Step Action": "Verify  \"Reason for Request\" drop down  includes\"UOCOVA\" \\n",
        "Step Expected": "\"UOCOVA\"must be displayedin the drop down values\\n\\n\\n"
      },
      {
        "Step": 3,
        "Step Action": "Verify  \"Application type\" drop down  includes \"Regular absentee\"",
        "Step Expected": "\"Regular absentee\" must be displayed in the drop down values\\n"
      },
      {
        "Step": 4,
        "Step Action": "Verify \"Reason for Request\"and \"Application type\" dropdowns display order \\n",
        "Step Expected": "1.Must be displayed on the top of \"Ballot Request Information\" section2.\"Application type\" should appear first, followedby \"Reason for Request\\n"
      },
      {
        "Step": 5,
        "Step Action": "Verify Display Order of Mailing Address Field",
        "Step Expected": "1.Must display under Ballot Request Information\"\\n2.Below \"Reason for Request\"                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            "
      },
      {
        "Step": 6,
        "Step Action": "Verify Display Order of Domestic and International radio buttons ",
        "Step Expected": "Must be placed above the Mailing address fields"
      },
      {
        "Step": 7,
        "Step Action": "Verify Display Order of  \"Election Date Name\" and \"BallotType\" dropdowns\\n",
        "Step Expected": "Must appear under the address fields"
      },
      {
        "Step": 8,
        "Step Action": "Verify Is  Primary Election Radio Button-Checked\\n",
        "Step Expected": "Must enable \"Party Type\"drop down and display \"Republican\" and \"Democrat\" \\n\\n\\n\\n\\n\\n"
      },
      {
        "Step": 9,
        "Step Action": "Verify Is Primary Election Radio Button-Unchecked",
        "Step Expected": "\"Party Type\" drop down must be disabled"
      },
      {
        "Step": 10,
        "Step Action": "Verify Phone number and Email address textboxes",
        "Step Expected": "Must display in Contact Details section"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Sujatha Yelchuri <syelchuri@gocivix.com>",
    "State": "Ready"
  },
  {
    "ID": 88657,
    "Work Item Type": "Test Case",
    "Title": "VM - Ballot - Maintain Outstanding Absentee Ballots",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "VM - Ballot - Absentee Batch Processes\t\t\t\t",
        "Step Expected": ""
      }
    ],
    "Area Path": "SG\\\\Elections\\Java\\EMS",
    "Assigned To": "Jorge Taveras <jtaveras@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 88659,
    "Work Item Type": "Test Case",
    "Title": "VM-Ballot Add/Maintain UOCAVA/E&D Status",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Navigate to the \"Voter\" section and search for a voter",
        "Step Expected": "The user is able to search and select the voter successfully."
      },
      {
        "Step": 2,
        "Step Action": "On the voter information page, verify the \"Absentee\" tab is visible and accessible",
        "Step Expected": "The \"Absentee Ballot\" tab is displayed and accessible."
      },
      {
        "Step": 3,
        "Step Action": "Verify the \"Add/Maintain UOCAVA/Permanent Absentee Status\" button is visible under the \"Absentee\" tab",
        "Step Expected": "The button is clearly labeled as \"Add/Maintain UOCAVA/Permanent Absentee Status\" under the \"Absentee Ballot\" tab."
      },
      {
        "Step": 4,
        "Step Action": "Click the \"Add/Maintain UOCAVA/Permanent Absentee Status\" button",
        "Step Expected": "The user is navigated to a dedicated page for managing absentee status."
      },
      {
        "Step": 5,
        "Step Action": "Verify the stand-alone page is displayed with the voter card at the top",
        "Step Expected": "The page displays the voter card at the top."
      },
      {
        "Step": 6,
        "Step Action": "Verify the input fields on the page: - Annual Absentee Status (Dropdown) - Annual Absentee Status Reason (Dropdown) - UOCAVA Start Date (Date Picker) - UOCAVA End Date (Date Picker) - Ballot Mailing Address Checkbox (Conditional) - Mail Forwarding Address (Enabled for UOCAVA/FPCA)",
        "Step Expected": "All input fields are displayed correctly and are functional based on selection logic."
      },
      {
        "Step": 7,
        "Step Action": "Select \"UOCAVA/FPCA\" and verify the options in \"Annual Absentee Status Reason\" dropdown",
        "Step Expected": "The dropdown shows only: \"Citizen Residing Overseas,\" \"Member of Uniformed Services,\" \"Spouse/Dependent of Uniformed Services Member.\""
      },
      {
        "Step": 8,
        "Step Action": "Select \"Annual Application\" and verify the options in \"Annual Absentee Status Reason\" dropdown",
        "Step Expected": "The dropdown shows only: \"65 Years of Age or Older,\" \"Disability,\" \"Expected to Give Birth.\""
      },
      {
        "Step": 9,
        "Step Action": "Select \"Annual Application\" and check the Ballot Mailing Address checkbox",
        "Step Expected": "The system autofills the ballot mailing address with the voter’s registered address and locks the fields for editing."
      },
      {
        "Step": 10,
        "Step Action": "Uncheck the Ballot Mailing Address checkbox and verify the mailing address fields are editable",
        "Step Expected": "The mailing address fields become editable after unchecking the checkbox."
      },
      {
        "Step": 11,
        "Step Action": "Select \"UOCAVA/FPCA\" and verify the Mail Forwarding Address fields are enabled",
        "Step Expected": "The Mail Forwarding Address fields are enabled for input when \"UOCAVA/FPCA\" is selected."
      },
      {
        "Step": 12,
        "Step Action": "Select UOCAVA/FPCA and verify that the \"Preferred Method\" dropdown displays \"Mail,\" \"Email,\" and \"Fax\"",
        "Step Expected": "The \"Preferred Method\" dropdown shows the options: Mail, Email, and Fax."
      },
      {
        "Step": 13,
        "Step Action": "Select \"Annual Application\" and verify that only \"Mail\" is available in the \"Preferred Method\" dropdown",
        "Step Expected": "The \"Preferred Method\" dropdown shows only \"Mail.\""
      },
      {
        "Step": 14,
        "Step Action": "Verify error handling for missing required fields (e.g., missing status reason or start/end date)",
        "Step Expected": "\\nAn error message is displayed indicating the missing required fields.\\n"
      },
      {
        "Step": 15,
        "Step Action": "Verify error handling if \"Annual/UOCAVA End Date\" is earlier than \"Annual/UOCAVA Start Date\"",
        "Step Expected": "An error message prompts the user to correct the dates."
      },
      {
        "Step": 16,
        "Step Action": "Input valid data into all required fields and click the \"Save\" button",
        "Step Expected": "The system saves the data and updates the voter’s absentee status. The user is navigated back to the voter history page."
      },
      {
        "Step": 17,
        "Step Action": "Modify the absentee status and click \"Save\" to update",
        "Step Expected": "The system reflects the updated absentee status immediately after saving."
      },
      {
        "Step": 18,
        "Step Action": "Verify that the system tracks and records changes for audit purposes",
        "Step Expected": "The audit logs track the changes made to the absentee status with details like the date and the user who made the changes."
      },
      {
        "Step": 19,
        "Step Action": "Simulate an error during the save/update process",
        "Step Expected": "The system displays a relevant error message, and no data is saved until the issue is resolved."
      },
      {
        "Step": 20,
        "Step Action": "Verify that the \"Add/Maintain UOCAVA/Permanent Absentee Status\" button changes to \"Add/Maintain UOCAVA/Annual Absentee\" after saving/updating",
        "Step Expected": "The button is updated to \"Add/Maintain UOCAVA/Annual Absentee\" after saving or updating the status."
      }
    ],
    "Area Path": "SG\\\\Elections\\Java\\EMS",
    "Assigned To": "Jorge Taveras <jtaveras@gocivix.com>",
    "State": "Design"
  }
]