[
  {
    "ID": 81501,
    "Work Item Type": "Test Case",
    "Title": "69356-Verify Participation History Page Display and Functionality",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Navigate to Voter->Search->Select a voter->Actions->View->\\nParticipation History",
        "Step Expected": "Verify below columns are displayed on the grid.\\nElection Date\\nElection Name\\nParty (Primary Election only)\\nMethod of Request\\nRequest Location\\nPrecinct\\nBallot Sent Date\\nBallot Received Date\\nBallot Return Method\\nBallot Status\\nBallot Status Reason\\nPolling Locations"
      },
      {
        "Step": 2,
        "Step Action": "Verify the \"Add\" button is displayed \\nClick  on \"Add\"",
        "Step Expected": "Add/Maintain Participation screen must be displayed\\n"
      },
      {
        "Step": 3,
        "Step Action": "Enter all the  fields and click on \"Create\"",
        "Step Expected": "Record must be created successfully "
      },
      {
        "Step": 4,
        "Step Action": "Verify the added record is displayed in the grid on \\nParticipation History screen\\n",
        "Step Expected": "Added record must be displayed and column values must be displayed appropriately."
      },
      {
        "Step": 5,
        "Step Action": "Verify the pagination functionality",
        "Step Expected": "Next and previous button must work accordingly"
      },
      {
        "Step": 6,
        "Step Action": "Verify the sorting functionality",
        "Step Expected": "Sorting functionality must work accordingly"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Sujatha Yelchuri <syelchuri@gocivix.com>",
    "State": "Ready"
  },
  {
    "ID": 83008,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Verify that the party field dropdown appears when a primary election is selected",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given User is on the Voter Participation page and Select a primary election from the election dropdown.",
        "Step Expected": "The party field dropdown should be visible and enabled and dropdown values should be present and user must be able to select an option.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83009,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Ensure that the party field is hidden for non-primary elections",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given User is on the Voter Participation page and Select a non-primary election from the election dropdown.",
        "Step Expected": "The party field should be hidden\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83010,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Verify that the user cannot proceed without selecting a party in a primary election.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user is on the Voter Participation page with a primary election selected and attempt to proceed without selecting a party.",
        "Step Expected": "The system should prevent proceeding and display an appropriate error message.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83011,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Ensure that the system validates the party selection for primary elections.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user is on the Voter Participation page with a primary election selected and Select a party from the dropdown followed by proceeding to next step. ",
        "Step Expected": "The system should accept the selection and allow the user to proceed.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83012,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Check that the party dropdown options correspond to the election selected.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user is on the Voter Participation page and select a primary election from the dropdown.",
        "Step Expected": "he party dropdown should display only the parties relevant to the selected primary election.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83017,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Verify that the system notifies the user when an invalid voter ID is submitted.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user is on the Voter Participation page and enter an invalid voter ID in the input field followed by clicking Insert button",
        "Step Expected": "The system should display a notification in the message box indicating that the voter ID is invalid.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83020,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Ensure the system notifies the user when a duplicate voter ID is submitted.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user is on the Voter Participation page with an existing voter ID in the system. Enter the existing (duplicate) voter ID in the input field. Click Insert.",
        "Step Expected": "The system should display a notification in the message box indicating that the voter ID has already been added.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83023,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Verify that a summary confirmation lists all processed voter IDs, highlighting any that failed validation.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user has submitted a mix of valid and invalid voter IDs and submit the voter IDs by clicking Insert.",
        "Step Expected": "A summary confirmation should display all submitted IDs, highlighting those that are invalid or duplicates in red.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83024,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Ensure users are informed of the reasons for any failed voter IDs.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user has submitted a mix of valid and invalid voter IDs and click Insert.",
        "Step Expected": "The system should provide specific reasons for each failed ID.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83025,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Verify that the system processes valid voter IDs without errors.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given User is on the Voter Participation page and enter only valid voter IDs in the input fields and click Insert.",
        "Step Expected": "The system should process all valid IDs without any notifications for errors, and a confirmation message should appear.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83026,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Error handling for mix of valid, invalid, and duplicate voter IDs.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given User is on the Voter Participation page and Enter a combination of valid, invalid, and duplicate voter IDs and click Insert.",
        "Step Expected": "The system should notify the user of invalid and duplicate IDs, provide a summary confirmation with the status of each ID, and detail the reasons for any failures.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83028,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Verify that a confirmation message displays the number of successfully processed voter IDs.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given User is on the Voter Participation page and has entered valid voter IDs and enter 5 valid voter IDs and click Insert button.",
        "Step Expected": "A confirmation message appears at the bottom of the page indicating the number of successful entries.\\n"
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83029,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Ensure that the system displays error messages for voter IDs that could not be processed.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given user is on the Voter Participation page and has entered a mix of valid and invalid voter IDs. Enter a combination of valid IDs and one invalid ID. Click insert.",
        "Step Expected": "The confirmation message shows the number of successful entries and details the error(s) encountered, including specific messages like:\"Cannot update election history details for Voter with Voter ID xxxx because the voter does not exist or is not in the correct status.\""
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  },
  {
    "ID": 83030,
    "Work Item Type": "Test Case",
    "Title": "Multiple Voter Participation - Verify that the system correctly identifies and reports a duplicate voter history entry.",
    "Test Steps": [
      {
        "Step": 1,
        "Step Action": "Given User is on the Voter Participation page and has entered a voter ID that already has history for the selected election. Enter a voter ID with existing election history.Click the \"Insert\" button.\\n",
        "Step Expected": "The confirmation message includes an error indicating:\"Cannot update election history details for Voter with Voter ID xxxx because the voter already has voter history for this election.\""
      }
    ],
    "Area Path": "SG\\\\Elections\\Java",
    "Assigned To": "Shreya Nyapati <snyapati@gocivix.com>",
    "State": "Design"
  }
]